; domain
(define (domain minerob)
  (:requirements :strips :typing :negative-preconditions :equality :adl)

  (:types area minecar)

  (:predicates
    (robot-at ?a - area)                    ;; robot is located at area ?a
    (minecar-at ?m - minecar ?a - area)     ;; minecar ?m is at area ?a
    (minerals ?a - area)                    ;; area ?a contains minerals
    (depleted ?a - area)                    ;; area ?a has been depleted (no minerals)
    (empty ?a - area)                       ;; there is no minecar in area ?a
    (adjacent ?a1 - area ?a2 - area)        ;; adjacency (horizontal/vertical)
  )

  ;; MOVE: robot walks from one area to an adjacent area.
  ;; Precondition: destination must be empty of minecars.
  (:action move
    :parameters (?from - area ?to - area)
    :precondition (and
      (robot-at ?from)
      (adjacent ?from ?to)
      ;(empty ?to)                            ;; cannot step into a minecar
    )
    :effect (and
      (not (robot-at ?from))
      (robot-at ?to)
    )
  )

  ;; COLLECT: robot drills and collects minerals in current area.
  (:action collect
    :parameters (?a - area)
    :precondition (and
      (robot-at ?a)
      (minerals ?a)
      (empty ?a)                               ;; not minecart into to collect
    )
    :effect (and
      (not (minerals ?a))
      (depleted ?a)
    )
  )

  ;; PUSH: robot pushes a minecar forward.
  ;; Semantics chosen: robot stands *behind* the minecar, pushes the minecar from its current cell into the next cell.
  ;; Precond: robot adjacent to minecar source cell, the target cell (where the minecar will go) is adjacent to the minecar cell and is empty.
  ;; Effects: robot moves into the minecar's old cell, minecar moves into the target cell;
  ;;          minecar's old cell becomes empty, the target cell becomes non-empty.
  (:action push
    :parameters (?m - minecar ?mcpos - area ?target - area)
    :precondition (and
      (robot-at ?mcpos)
      (minecar-at ?m ?mcpos)
      (adjacent ?mcpos ?target)              ;; target is adjacent to minecar cell
      (empty ?target)                         ;; target must be free of minecars
    )
    :effect (and
      ;; robot moves into minecar's old position
      ;(not (robot-at ?rpos))
      ;(robot-at ?mcpos)

      ;; minecar moves from mcpos to target
      (not (minecar-at ?m ?mcpos))
      (minecar-at ?m ?target)

      ;; empty predicate bookkeeping
      (empty ?mcpos)                          ;; old minecar cell becomes empty
      (not (empty ?target))                   ;; new minecar cell becomes non-empty
    )
  )
)

; problem
(define (problem minerob-second-example-3x3)
  (:domain minerob)

  (:objects
    a1 a2 a3 a4 a5 a6 a7 a8 a9 - area
    carA - minecar
  )

  ;; initial state
  (:init
    ;; adjacency (grid 3x3)
    ;; row 1
    (adjacent a1 a2) (adjacent a2 a1)
    (adjacent a2 a3) (adjacent a3 a2)
    (adjacent a4 a5) (adjacent a5 a4)
    (adjacent a5 a6) (adjacent a6 a5)
    (adjacent a7 a8) (adjacent a8 a7)
    (adjacent a8 a9) (adjacent a9 a8)

    (adjacent a1 a4) (adjacent a4 a1)
    (adjacent a2 a5) (adjacent a5 a2)
    (adjacent a3 a6) (adjacent a6 a3)
    (adjacent a4 a7) (adjacent a7 a4)
    (adjacent a5 a8) (adjacent a8 a5)
    (adjacent a6 a9) (adjacent a9 a6)

    ;; robot start
    (robot-at a1)

    ;; minecars initial positions
    (minecar-at carA a9)

    ;; empty bookkeeping: any cell with no minecar must be declared empty
    (empty a1)
    (empty a2) 
    (empty a3) 
    (empty a4) 
    (empty a5)
    (empty a6)  
    (empty a7) 
    (empty a8)

    ;; minerals (some cells have minerals
    (minerals a1)
    (minerals a2)
    (minerals a3)
    (minerals a4)
    (minerals a5)
    (minerals a6)
    (minerals a7)
    (minerals a8)
    (minerals a9)

    ; No depleted cells
    
  )

  ;; goal: all minerals collected (depleted) and specific final minecar positions
  (:goal (and

    ; Recolected materials
    (depleted a1)
    (depleted a2)
    (depleted a3)
    (depleted a4)
    (depleted a5)
    (depleted a6)
    (depleted a7)
    (depleted a8)
    (depleted a9)
    
    ;; final positions for minecars (example)
    (minecar-at carA a1)

    ;; final position for robot
    (robot-at a9)
  ))
)

; plan
1. (collect a1)
   deleted: (minerals a1)
   added: (depleted a1)
   goals met: 1 of 11
2. (move a1 a2)
   deleted: (robot-at a1)
   added: (robot-at a2)
   goals met: 1 of 11
3. (collect a2)
   deleted: (minerals a2)
   added: (depleted a2)
   goals met: 2 of 11
4. (move a2 a3)
   deleted: (robot-at a2)
   added: (robot-at a3)
   goals met: 2 of 11
5. (collect a3)
   deleted: (minerals a3)
   added: (depleted a3)
   goals met: 3 of 11
6. (move a3 a6)
   deleted: (robot-at a3)
   added: (robot-at a6)
   goals met: 3 of 11
7. (move a6 a9)
   deleted: (robot-at a6)
   added: (robot-at a9)
   goals met: 4 of 11
8. (push cara a9 a6)
   deleted: (minecar-at cara a9) (empty a6)
   added: (minecar-at cara a6) (empty a9)
   goals met: 4 of 11
9. (move a9 a6)
   deleted: (robot-at a9)
   added: (robot-at a6)
   goals met: 3 of 11
10. (push cara a6 a5)
   deleted: (minecar-at cara a6) (empty a5)
   added: (minecar-at cara a5) (empty a6)
   goals met: 3 of 11
11. (collect a6)
   deleted: (minerals a6)
   added: (depleted a6)
   goals met: 4 of 11
12. (move a6 a5)
   deleted: (robot-at a6)
   added: (robot-at a5)
   goals met: 4 of 11
13. (push cara a5 a4)
   deleted: (minecar-at cara a5) (empty a4)
   added: (minecar-at cara a4) (empty a5)
   goals met: 4 of 11
14. (collect a5)
   deleted: (minerals a5)
   added: (depleted a5)
   goals met: 5 of 11
15. (move a5 a4)
   deleted: (robot-at a5)
   added: (robot-at a4)
   goals met: 5 of 11
16. (push cara a4 a1)
   deleted: (minecar-at cara a4) (empty a1)
   added: (minecar-at cara a1) (empty a4)
   goals met: 6 of 11
17. (collect a4)
   deleted: (minerals a4)
   added: (depleted a4)
   goals met: 7 of 11
18. (move a4 a7)
   deleted: (robot-at a4)
   added: (robot-at a7)
   goals met: 7 of 11
19. (collect a7)
   deleted: (minerals a7)
   added: (depleted a7)
   goals met: 8 of 11
20. (move a7 a8)
   deleted: (robot-at a7)
   added: (robot-at a8)
   goals met: 8 of 11
21. (collect a8)
   deleted: (minerals a8)
   added: (depleted a8)
   goals met: 9 of 11
22. (move a8 a9)
   deleted: (robot-at a8)
   added: (robot-at a9)
   goals met: 10 of 11
23. (collect a9)
   deleted: (minerals a9)
   added: (depleted a9)
   goals met: 11 of 11
